export const MARKER_MAP = {
  安徽: {},
  澳门: {},
  北京: {},
  福建: {
    children: {
      厦门: {
        children: {
          鼓浪屿: {
            coords: [118.07, 24.45],
            route: "/2020/xiamen",
          },
          黄厝海滩: {
            coords: [118.16, 24.44],
            route: "/2020/xiamen",
          },
        },
      },
    },
  },
  甘肃: {},
  广东: {},
  广西: {},
  贵州: {},
  海南: {},
  河北: {},
  河南: {},
  黑龙江: {},
  湖北: {},
  湖南: {
    children: {
      长沙: {
        children: {
          橘子洲头: {
            coords: [112.96, 28.17],
          },
          五一广场: {
            coords: [112.976352, 28.194306],
          },
        },
      },
      张家界: {
        coords: [110.480018, 29.069878],
      },
    },
  },
  吉林: {
    children: {
      长白山: {
        coords: [127.5, 42.11],
      },
    },
  },
  江苏: {
    children: {
      南京: {
        coords: [118.8, 32.09],
      },
    },
  },
  江西: {
    children: {
      南昌: {
        coords: [115.85, 28.66],
      },
    },
  },
  辽宁: {},
  内蒙古: {},
  宁夏: {},
  青海: {},
  山东: {
    children: {
      泰山: {
        coords: [117.135354, 36.192084],
      },
    },
  },
  山西: {},
  陕西: {},
  上海: {
    children: {
      迪斯尼: {
        coords: [121.67, 31.14],
      },
      外滩: {
        coords: [121.49, 31.23],
      },
    },
  },
  四川: {},
  台湾: {},
  天津: {},
  西藏: {},
  香港: {},
  新疆: {},
  云南: {
    children: {
      丽江: {
        coords: [100.25, 26.81],
      },
      大理: {
        coords: [100.3, 25.68],
      },
    },
  },
  浙江: {
    children: {
      舟山: {
        coords: [122.106863, 30.016028],
      },
      杭州: {
        coords: [120.1536, 30.2655],
      },
      宁波: {
        coords: [121.18, 30.32],
      },
    },
  },
  重庆: {
    coords: [106.55, 29.61],
  },
};
